export default function Menu() {
  return (
    <nav>
      <ul>
        {/* --------------------------------------------섹션1 */}
        <li>
          <ul>
            <li>
              {/* 메뉴아이콘 */}
            </li>
            <li>
              {/* 로고 */}
            </li>
          </ul>
        </li>

        {/* ---------------------------------------------섹션2 */}
        <li>
          <ul>
            <li>
              {/* 검색바 */}
            </li>
            <li>
              {/* 음성검색아이콘 */}
            </li>
          </ul>
        </li>

        {/* ----------------------------------------------섹션3 */}
        <li>
          <ul>
            <li>
              {/*설정 버튼 */}
            </li>
            <li>
              {/* 로그인버튼 */}
            </li>
          </ul>
        </li>
      </ul>
    </nav>
  )
}